# Используем официальный образ Go
FROM golang:1.20 AS builder

# Устанавливаем рабочую директорию
WORKDIR /app

# Копируем файлы модуля и загружаем зависимости
COPY go.mod go.sum ./
RUN go mod download

# Копируем исходный код
COPY . .

# Сборка приложения
RUN go build -o app .

# Используем легкий образ для финальной сборки
FROM alpine:latest

# Устанавливаем рабочую директорию
WORKDIR /root/

# Копируем скомпилированное приложение из образа builder
COPY --from=builder /app/app .

# Указываем порт для работы (если ваше приложение использует этот порт)
EXPOSE 6003

# Запуск приложения
CMD ["./app"]
